commands_templates/SetRemoteDiscoveryMode0.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsdl="http://www.onvif.org/ver10/device/wsdl">
   <soap:Header/>
   <soap:Body>
      <wsdl:SetRemoteDiscoveryMode>
         <!--type: DiscoveryMode - enumeration: [Discoverable,NonDiscoverable]-->
         <wsdl:RemoteDiscoveryMode>?</wsdl:RemoteDiscoveryMode>
      </wsdl:SetRemoteDiscoveryMode>
   </soap:Body>
</soap:Envelope>